package Homework4;


import java.util.Arrays;
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {

        Scanner scanner = new Scanner(System.in);
        System.out.println("Введите размер массива");
        int size = scanner.nextInt();
        int[] array = new int[size];
//__________________________________________________________________________________________
//       //Ручной ввод
        for (int i = 0; i < size; i++) {
            array[i] = scanner.nextInt();
        }
//__________________________________________________________________________________________
//      //Рандомные числа
//        for (int i = 0; i < size; i++) {
//            array[i] = (int) (Math.random() * 100);
//        }
//       //Выводим исходный массив
        System.out.println("Исходный массив:");
        for (int i = 0; i < size; i++) {
            System.out.print(array[i] + " ");
        }
        System.out.println("");
//__________________________________________________________________________________________
//        // Task 1:
//        // Пройти по массиву, вывести все элементы в прямом и в обратном порядке
//__________________________________________________________________________________________
//******************************************************************************************
//        System.out.println("Прямой порядок:");
//        for (int i = 0; i < size; i++) {
//            System.out.print(array[i] + " ");
//        }
//        System.out.println();
//        System.out.println("Обратный порядок:");
//        for (int i = size - 1; i >= 0; i--) {
//            System.out.print(array[i] + " ");
//        }
//******************************************************************************************
//__________________________________________________________________________________________
//        // Task 2
//        // Найти минимальный-максимальный элементы и вывести в консоль.
//__________________________________________________________________________________________
//******************************************************************************************
//        int max = array[0];
//        int min = array[0];
//        // Минимальный элемент
//        for (int i = 0; i < array.length; i++) {
//            if (array[i] < min) {
//                min = array[i];
//            }
//        }
//        System.out.println("Минимальный элемент массива: " + min);
//        //Максимальный элемент
//        for (int i = 0; i < array.length; i++) {
//            if (array[i] > max) {
//                max = array[i];
//            }
//        }
//        System.out.println("Максимальный элемент массива: " + max);
//******************************************************************************************
//__________________________________________________________________________________________
//      // Task 3
//      //Найти индексы минимального и максимального элементов и вывести в консоль.
//__________________________________________________________________________________________
//      //Индекс минимального элемента
//        int minIndex = 0;
//        int maxIndex = 0;
//        for (int i = 0; i < array.length; i++) {
//            if (array[i] < array[minIndex]) {
//                minIndex = i;
//            }
//        }
//        System.out.println("Минимальный индекс массива: " + minIndex);
//        //Индекс максимального элемента
//        for (int i = 0; i < array.length; i++) {
//            if (array[i] > array[maxIndex]) {
//                maxIndex = i;
//            }
//        }
//        System.out.println("Максимальный индекс массива: " + maxIndex);
//__________________________________________________________________________________________
//      // Task 4
//      // Найти и вывести количество нулевых элементов. Если нулевых элементов нет -
//      // вывести сообщение, что их нет.
//__________________________________________________________________________________________
//        int countNull = 0;
//        for (int i = 0; i < array.length; i++) {
//            if (array[i] == 0){
//                countNull++;
//            }
//        }
//        if (countNull == 0){
//            System.out.println("Нулевых элементов нет");
//        }else{
//            System.out.println("Колличество нулевых элементов: " + countNull);
//        }
//__________________________________________________________________________________________
//      // Task 5
//      // Пройти по массиву и поменять местами элементы первый и последний, второй и
//      // предпоследний и т.д.
//__________________________________________________________________________________________
//        for (int i = 0; i < size / 2; i++) {
//            int x = array[i];
//            array[i] = array[size - 1 - i];
//            array[size - 1 - i] = x;
//        }
//        System.out.println("");
//        System.out.println("Массив с измененными местами элементами:");
//        for (int i = 0; i < size; i++) {
//            System.out.print(array[i] + " ");
//        }
//__________________________________________________________________________________________
//      // Task 6
//      // Проверить, является ли массив возрастающей последовательностью (каждое следующее
//      // число больше предыдущего).
//__________________________________________________________________________________________
//        boolean flag = true;
//        for (int i = 1; i < size; i++) {
//            if (array[i] <= array[i - 1]) {
//                flag = false;
//                break;
//            }
//        }
//        if (flag) {
//            System.out.println("Массив является возрастающей последовательностью.");
//        } else {
//            System.out.println("Массив не является возрастающей последовательностью.");
//        }
//__________________________________________________________________________________________
//      // Задача *:
//      // Имеется массив из неотрицательных чисел(любой). Представьте что массив
//      // представляет целое число (Например массив {1,2,3} -> 123, {9,9,9} -> 999). Задача
//      // добавить единицу к этому “числу” и на выходе получить исправленный массив. Массив не
//      // содержит нуля в начале, кроме самого числа 0.
//__________________________________________________________________________________________
        int countOf9 = 0;
        for (int i = 0; i <= array.length - 1; i++) {
            if (array[i] == 9) {
                countOf9++;
            }
        }
        int number = 0;
        int base = 10;
        for (int i = 0; i < size; i++) {
            number = base * number + array[i];
        }
        number++;
        String numberString = Integer.toString(number);
        char[] charArray = numberString.toCharArray();

        if (countOf9 == array.length) {
            size = countOf9 + 1;
            int[] newArray = new int[size];

            for (int i = 0; i < size; i++) {
                newArray[i] = Character.getNumericValue(charArray[i]);
            }
            System.out.println("Массив + 1:");
            for (int i = 0; i < size; i++) {
                System.out.print(newArray[i] + " ");
            }
        } else {
            for (int i = 0; i < size; i++) {
                array[i] = Character.getNumericValue(charArray[i]);
            }
            System.out.println("Массив + 1:");
            for (int i = 0; i < size; i++) {
                System.out.print(array[i] + " ");
            }
            scanner.close();
        }

    }
}

